class Const {
  static String appName = "الغرابلي غرب الدلتا";
  static String splashLogo = "assets/images/logo.png";
  static String scaffoldImage = "assets/images/background.png";
  static String oilTank = "assets/images/oilTank.png";
  static String falseStop = "assets/images/oilTank.png";
  static String addImage = "assets/images/add-image.png";
  static String tripIcon = "assets/images/trip.png";
  static String shiftIcon = "assets/images/shift.png";

  static List<String> fuelTypeList = [
    "زيت",
    "سولار",
    "سولار وزيت",
  ];

  static List<String> trainTypeList = [
    "اسمنت",
    "اكسيد",
    "تجهيز",
    "حاويات",
    "رخام",
    "سولار",
    "طفلة",
    "غلال",
    "فوارغ عمرة",
    "فوسفات",
    "كلينكر",
    "مفرد",
    "مواسير",
  ];

  static List<String> trainStateList = [
    "مشحون",
    "فوارغ",
  ];

  static Map<String, String> trainCap = {
    " ابراهيم محمود البقلى ": "22239",
    "احمد حفني احمد عفيفي": "22300",
    "السيد البدوي محمد عبد العليم محمد": "22302",
    "أبو بكر الصديق يوسف أحمد ": "86459",
    "أسامة حسن محمد أحمد": "86463",
    "أمير إميل لمعي رزق الله": "22245",
    "بلال محمود أبو الفتح محمود ": "22315",
    "حسام سعد عبد القادر أحمد": "22199",
    "حسن محمد محمود عبد الرحمن ": "22247",
    "رشاد قاسم احمد حسن ": "22254",
    "زكريا احمد إسماعيل حجازي": "26466",
    "سعيد السيد عبد المنعم علي": "22201",
    "صابر فتحى حامد الغنام ": "22259",
    "علاء عبد البديع عبد الوكيل الجندي": "22267",
    "عماد صلاح نصر أحمد ندا": "87566",
    "مجدي احمد على  يوسف": "22271",
    "محمد أحمد عبد اللطيف خليل": "86415",
    "محمد أصيل محمود محمد عويس": "87054",
    "محمد طه محمد عطية ": "26468",
    "محمد على فهمى عتلم ": "22233",
    "محمد فتحي السيد خاطر": "22280",
    "محمد فرج أحمد إبراهيم": "26563",
    "محمد محمود سيف النصر السيد": "22294",
    "محمود سعد عبد الشافى احمد ": "22293",
    "محمود كمال عبد الله عبد العال": "85889",
    "محمود محمد أحمد سليمان": "22283",
    "مصطفى أحمد فؤاد السيد شحاته": "85902",
    "مصطفى جابر مصطفى الخياط": "22284",
    "مصطفى علي رزق علي": "86418",
    "منصور عبد الهادي منصور عبد النبي": "86416",
  };

  static Map<String, String> trainConductor = {
    "احمد ابو القاسم احمد عبد المجيد ": "89870",
    "احمد بدوى بدوى ابو غربية ": "88305",
    "احمد رجب أبو زيد سليم ": "86034",
    "احمد محمد اسماعيل عيد احمد ": "89873",
    "احمدنصرمحمداحمد": "87239",
    "اكرم موسى جيد حندى": "86691",
    "أحمد عبد العزيز سعد الجلايلي": "85969",
    "أسامة عطية مبروك محمد كريم": "87236",
    "حسام حسن سعد عبد الله": "87144",
    "حسام عمر عبد الحميد البكرى": "87238",
    "صلاح سعد محمد عبدالسيد محمد دحروج": "89875",
    "عادل عبد الله مهنا ": "22168",
    "عبد الهادي فتحي عبد الحليم ": "22158",
    "عماد عاطف يونس ": "86021",
    "محمد سعيد بكر الجارحى": "86018",
    "محمد عدلى سعد دراوى ": "89872",
    "محمد على محمد منصور ": "86643",
    "محمود محمد على محمد السيد احمد ": "89874",
    "مصطفى عبدة عبدالناصر عبدة": "88108",
    "موسى محمد موسى": "86538",
    "والى فايز عبد الرازق عبد الله ": "86172",
  };
}
